In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Precipitaciones.csv')
df.head()

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9
1,ALBACETE,68.1,28.0,26.2,65.3,25.4,50.0,2.0,34.5,48.0,44.8,33.1,14.1,439.5
2,ALICANTE,49.2,3.7,63.2,85.8,57.2,20.0,9.2,5.0,44.0,41.1,47.4,1.8,427.6
3,ALMERIA,56.3,5.2,35.8,43.1,38.8,16.9,10.2,1.9,17.4,27.3,32.6,3.2,288.7
4,ARABA,96.8,79.9,38.0,52.0,37.7,107.8,8.5,17.7,63.3,38.5,212.2,197.3,949.7

In [3]:
serie = df['region']
serie.head()

0    A CORUNA
1    ALBACETE
2    ALICANTE
3     ALMERIA
4       ARABA
Name: region, dtype: object

In [4]:
datos = [10,20,30,40,50]
serie2 = pd.Series(datos)
serie2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
indices = ['a','b','c','d','e']
serie2 = pd.Series(datos,indices)
serie2

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
capitales = {'Espania':'Madrid','Peru':'Lima','Argentina':'Buenos Aires'}
serie3 = pd.Series(capitales)
serie3

Espania            Madrid
Peru                 Lima
Argentina    Buenos Aires
dtype: object

In [7]:
serie3['Peru']

'Lima'

In [8]:
serie = pd.Series([10,20,30,40,50])
serie

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [9]:
serie = serie * 2
serie

0     20
1     40
2     60
3     80
4    100
dtype: int64

In [10]:
serie = serie + 10
serie

0     30
1     50
2     70
3     90
4    110
dtype: int64

Limpieza de datos

In [11]:
data = {
    "Id_producto": [1001, 1002, 1003, 1003],
    "Cantidad_vendida": [30, None, 25,25],
    "Precio": [15.5, 20.0, None, 25.0]
}
data2 = pd.DataFrame(data)
data2

   Id_producto  Cantidad_vendida  Precio
0         1001              30.0    15.5
1         1002               NaN    20.0
2         1003              25.0     NaN
3         1003              25.0    25.0

In [12]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id_producto       4 non-null      int64
 1   Cantidad_vendida  3 non-null      float64
 2   Precio            3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 228.0 bytes

In [13]:
data2.isnull().sum()

Id_producto         0
Cantidad_vendida    1
Precio              1
dtype: int64

Limpiar datos vacios

In [14]:
df_eliminados = data2.dropna()
df_eliminados

   Id_producto  Cantidad_vendida  Precio
0         1001              30.0    15.5
3         1003              25.0    25.0

Rellenar espacios vacios

In [15]:
valores_nuevos = {"Cantidad_vendida": 0,"Precio": data2["Precio"].mean()}
df_rellenados = data2.fillna(valores_nuevos)
df_rellenados

   Id_producto  Cantidad_vendida     Precio
0         1001              30.0  15.500000
1         1002               0.0  20.000000
2         1003              25.0  20.166667
3         1003              25.0  25.000000

Modificar tipo de dato de la serie dentro del Data Frame

In [16]:
df_rellenados["Cantidad_vendida"] = df_rellenados["Cantidad_vendida"].astype(int)
df_rellenados

   Id_producto  Cantidad_vendida     Precio
0         1001                30  15.500000
1         1002                 0  20.000000
2         1003                25  20.166667
3         1003                25  25.000000

Limpiar duplicados

In [17]:
df_unicos = df_rellenados.drop_duplicates(subset="Id_producto")
df_unicos

   Id_producto  Cantidad_vendida     Precio
0         1001                30  15.500000
1         1002                 0  20.000000
2         1003                25  20.166667

Filtrado de series

In [18]:
serie = pd.Series([5,10,15,20,25])
serie

0     5
1    10
2    15
3    20
4    25
dtype: int64

In [19]:
filtro = serie > 15
serie_filtrada = serie[filtro]
serie_filtrada

3    20
4    25
dtype: int64

In [22]:
numeros = pd.Series([10,20,30,40,50])
promedio = numeros.mean()
promedio

np.float64(30.0)

In [24]:
total = numeros.sum()
total

np.int64(150)

In [25]:
numeros.max()

np.int64(50)

In [26]:
numeros.min()

np.int64(10)